Autodesk.Revit.UI.Events.OptimizeAnnotationsEditModeEnteredEventArgs.ActiveViewId
The id of the active view when the edit mode was entered.

Autodesk.Revit.UI.Events.OptimizeAnnotationsEditModeEnteredEventArgs
The event arguments used by the OptimizeAnnotationsEditModeEntered event.